disco/riassunto/ideale.org
#+LATEX_HEADER: \usepackage{amsfonts}
* Definizione
Un ideale è un sottinsieme $I \subseteq R$ di un anello che
 - include lo $0$ ($0_R \in I$)
 - È chiuso rispetto alla somma (se $a,b \in i$ allora $a+_r b \in i$)
 - È assorbente rispetto al prodotto (se $a \in I$ allora
   $a \cdot _R b \in I \forall b \in R$)

Spesso e volentieri questo è solo un modo eccessivamente formale per
dire che un ideale è l'insieme dei multipli di qualcosa, per
non lasciarlo troppo all'aria verifichiamolo con l'insieme degli
interi multipli di 5, $\text{multipli di 5 } \subseteq \mathbb{Z}$.

I multipli di 5
 - Includono lo 0
 - Sono chiusi rispetto alla somma ($5a +_{\mathbb{Z}} 5b = 5(a+_{\mathbb{Z}}b)$)
 - Sono assorbenti rispetto al prodotto ($5a \cdot_{\mathbb{Z}} b = 5(a \cdot_{\mathbb{Z}} b)$)

Visto che scrivere /multipli di <coso>/ ogni volta per paralre di
insiemi del genere rompe il cazzo, si introduce la notazione

\[ (n) = \text{ insieme dei multipli di n }
= \{y \in R | \ \exists  r \in R : y = n \cdot_{R} r\} \]

$(n)$ si dice anche /ideale principale generato da $n$/

** Teoremi et al

*** Quella dannata biezione

*** La retroimmagine di un ideale è un ideale

*** ogni ideale di $\mathbb{Z}$ è un ideale principale
