disco/riassunto/ideale.tex
% Created 2022-10-03 Mon 08:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{amsfonts}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Definizione}
\label{sec:orgb93c3bc}
Un ideale è un sottinsieme \(I \subseteq R\) di un anello che
\begin{itemize}
\item include lo \(0\) (\(0_R \in I\))
\item È chiuso rispetto alla somma (se \(a,b \in i\) allora \(a+_r b \in i\))
\item È assorbente rispetto al prodotto (se \(a \in I\) allora
\(a \cdot _R b \in I \forall b \in R\))
\end{itemize}

Spesso e volentieri questo è solo un modo eccessivamente formale per
dire che un ideale è l'insieme dei multipli di qualcosa, per
non lasciarlo troppo all'aria verifichiamolo con l'insieme degli
interi multipli di 5, \(\text{multipli di 5 } \subseteq \mathbb{Z}\).

I multipli di 5
\begin{itemize}
\item Includono lo 0
\item Sono chiusi rispetto alla somma (\(5a +_{\mathbb{Z}} 5b = 5(a+_{\mathbb{Z}}b)\))
\item Sono assorbenti rispetto al prodotto (\(5a \cdot_{\mathbb{Z}} b = 5(a \cdot_{\mathbb{Z}} b)\))
\end{itemize}

Visto che scrivere \emph{multipli di <coso>} ogni volta per paralre di
insiemi del genere rompe il cazzo, si introduce la notazione

\[ (n) = \text{ insieme dei multipli di n }
= \{y \in R | \ \exists  r \in R : y = n \cdot_{R} r\} \]

\((n)\) si dice anche \emph{ideale principale generato da \(n\)}

\subsection{Teoremi et al}
\label{sec:org94342a6}

\subsubsection{Quella dannata biezione}
\label{sec:org1cdec2c}

\subsubsection{La retroimmagine di un ideale è un ideale}
\label{sec:org969e930}

\subsubsection{ogni ideale di \(\mathbb{Z}\) è un ideale principale}
\label{sec:orgb830b41}
\end{document}